AUTHDEC  CSECT ,                   Transactional State Evaluator
         BAKR  14,0                Save state
         BASR  12,0
         USING *,12
*
         LM    2,3,4(1)            R2 = Addr of CURRTX, R3 = Addr of ERRCODE
         L     4,8(,1)             R4 = Addr of TARGET AUTHSTAT BUFFER
*
         CLC   0(4,3),=C'0000'     Is the accumulated system thread error clean?
         BNE   SET_REJECT          If not equal, branch to reject state mapping
*
         MVC   0(5,4),=C'APPRV'    Apply operational authorization confirmation
         B     DEC_DONE
*
SET_REJECT DS  0H
         MVC   0(5,4),=C'REJCT'    Apply operational transaction decline code
*
DEC_DONE DS    0H
         XR    15,15               Resolution tracking complete
         PR
         LTORG ,
         END   AUTHDEC
